[
  {
    "college": "University Departments of Anna University  Chennai - CEG Campus  Sardar Patel Road  Guindy  Chennai 600 025",
    "ranking": 5,
    "cutoffDetails": []
  },
  {
    "college": "University Departments of Anna University  Chennai - ACT Campus  Sardar Patel Road  Guindy  Chennai 600 025",
    "ranking": 18,
    "cutoffDetails": []
  },
  {
    "college": "School of Architecture and Planning  Anna University Chennai 600025",
    "ranking": "101-150",
    "cutoffDetails": []
  },
  {
    "college": "University Departments of Anna University  Chennai - MIT Campus  Chrompet  Tambaram Taluk  Chengalpattu District 600 044",
    "ranking": 13,
    "cutoffDetails": []
  },
  {
    "college": "Annamalai University Faculty of Engineering and Technology Annamalai nagar Cuddalore",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "University College of Engineering  Villupuram  Kakuppam  Villupuram District 605103",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "University College of Engineering  Tindivanam  Melpakkam  Tindivanam  Villupuram District 604001",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "University College of Engineering  Arni  Arni to Devikapuram Road  Thatchur  Arni  Thiruvannamalai District 632326",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "University College of Engineering  Kancheepuram  Ponnerikarai Campus  NH4  Chennai-Bangalore Highway  Karaipettai Village & Post  Kancheepuram District 631552",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Aalim Muhammed Salegh College of Engineering, Nizara Educational Campus Muthapudupet, Avadi - IAF, Chennai-600055.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Bhajarang Engineering College, Ayathur Village, Veppampattu (R.S), Thiruvallur dist-602024.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Jaya Engineering College, Prakash Nagar, Thiruninravur, Thiruvallur District, Chennai-602024.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Jaya Institute of Technology, Kanchipadi, Thiruvallur-Thiruthani NH Road, Thiruvallur Taluk & District-631204.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Prathyusha Engineering College (Autonomous), Poonamallee-Tiruvallur High Road, Aranvoyalkuppam, Tiruvallur-602025.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "R.M.D. Engineering College (Autonomous), R.S.M. Nagar, Gummidipoondi Taluk, Kavaraipettai,  Thiruvallur-601206.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "R.M.K. Engineering College (Autonomous), R.S.M. Nagar, Kavaraipettai, Gummidipoondi Taluk, Thiruvallur-601206.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "S.A. Engineering College (Autonomous), Poonamallee- Avadi Road, Thiruverkadu Post, Tiruvallur, Chennai-600077.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "Sri Venkateswara College of Engineering and Technology, Thirupachur, Thiruvallur Taluk & District-631203.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Vel Tech Multi Tech Dr Rangarajan Dr Sakunthala Engineering College (Autonomous), 42, Veltech Road, Avadi, Morai, Thiruvallur-600062.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "SriRam Engineering College, Perumalpattu, Veppampattu R.S., Tiruvallur District, Chennai-602024.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Velammal Engineering College (Autonomous), Velammal Nagar, Ambattur-Redhills Road, Surapet, Thiruvallur, Chennai-600066.",
    "ranking": "101-150",
    "cutoffDetails": []
  },
  {
    "college": "Sri Venkateswara Institute of Science and Technology, Kolundhalur, Thiruvallur Taluk & District-631203.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Vel Tech High Tech Dr.Rangarajan Dr.Sakunthala Engineering College (Autonomous), No. 60, Veltech Road, Avadi, Morai, Thiruvallur-600062.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "Gojan School of Business and Technology, 80-Feet Road, Edapalayam, Red Hills, Thiruvallur, Chennai-600052.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "SAMS College of Engineering and Technology, 82,Panapakkam, Tirupathi Road, Uthukottai Taluk, Thiruvallur District-601102.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "PMR Engineering College, Adayalampattu, Tiruvallur, Chennai-600095.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "JNN Institute of Engineering (Autonomous), Ushaa Garden, 90, Kannigaipair Village, Uthukottai Taluk, Thiruvallur-601102.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "St. Peter's College of Engineering and Technology, College Road, Avadi Taluk, Thiruvallur District, Chennai-600054.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "R.M.K. College of Engineering and Technology (Autonomous), R.S.M. Nagar, Puduvoyal, Gummidipoondi Taluk, Thiruvallur District-601206.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "Annai Veilankannis College of Engineering, 33 Gandhi Road, Nedungundram, Chennai-600048.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Annai Mira College of Engineering and Technology, Arappakkam Village, Arcot Road, Walaja Taluk, Vellore District-632517.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Jeppiaar Institute of Technology (Autonomous), Jeppiaar Nagar, Kunnam Village,Sriperumbudur Taluk, Kanchipuram-631604.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "St. Joseph's Institute of Technology (Autonomous), Jeppiaar Nagar, Old Mamallapuram Road, Kanchipuram, Chennai-600119.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "Sri Jayaram Institute of Engineering and Technology, 51 N,Elavur, 58 N Natham Village,Gumudipoondi Taluk, Thiruvallur District-601201.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "DMI College of Engineering (Autonomous), St.Joseph's Town,Mevalurkuppam B Village, Nazarethpet Post, Palanchur, Kanchipuram, Chennai-600123.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Kings Engineering College, Irungattukottai, Opp. Hyundai Car Company, Sriperumbudur, Kanchipuram-602117.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "Pallavan College of Engineering, Thimmasamudram, Kanchipuram -631502.",
    "ranking": "\t201-300",
    "cutoffDetails": []
  },
  {
    "college": "Panimalar Engineering College (Autonomous), Bangalore Trunk Road, NazarathPet, Varadharajapuram, Poonamallee, Thiruvallur (DT), Chennai-600123.",
    "ranking": "101-150",
    "cutoffDetails": []
  },
  {
    "college": "Rajalakshmi Engineering College  (Autonomous), Rajalakshmi Nagar, Thandalam, Kanchipuram, Chennai-602105.",
    "ranking": "101-150",
    "cutoffDetails": []
  },
  {
    "college": "Rajiv Gandhi College of Engineering, Nemili Village, Sriperumbudur, Kanchipuram-602105.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "S K R Engineering College, Agarmel, Poonamallaee, Thiruvallur, Chennai-600123.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Saveetha Engineering College (Autonomous), Saveetha Nagar, Thandalam Post, Sriperumbudur Taluk, Kancheepuram District-602105.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "Sree Sastha Institute of Engineering and Technology, Chennai-Bangalore Highway, Chembarambakkam, Thiruvallur District, Chennai-600123.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Sri Muthukumaran Institute of Technology, Chikkarayapuram Near Mangadu, Kanchipuram, Chennai-600069.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Sri Venkateswara College of Engineering (Autonomous), Post Bag No.3, Pennalur, Sriperumbudur, Kanchipuram-602105.",
    "ranking": "101-150",
    "cutoffDetails": []
  },
  {
    "college": "Jaya College of Engineering and Technology, Poonamallee By Pass Road, Parivakkam, Chennai, Thiruvallur-600056.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "P.B. College of Engineering, Chennai-Bangalore High Way, Irungkattukottai, Sriperumbudur Taluk, Kancheepuram District, Chennai -602117.",
    "ranking": "201--300",
    "cutoffDetails": []
  },
  {
    "college": "Loyola Institute of Technology, Palanchur, Mevalurkuppam, B village, Nazarathpet Post, Sriperumpudur Taluk, Kanchipuram District, Chennai-600123.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "P.T.Lee Chengalvaraya Naicker College of Engineering and Technology, Oovery, Veliyur Post, Kanchipuram District-631502.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Alpha College of Engineering, No.34, Udayavar Kovil Street, Thirumazhisai, Chennai-600124.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Indira Institute of Engineering and Technology, No.1, V.G.R Nagar, V.G.R Gardens, Pandur, Thiruvallur -631203.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Apollo Engineering College, Mevaloorkuppam Valarpuram Post, Sriperumbudur Taluk, Kanchipuram District-602105.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "ARM College of Engineering and Technology, Sattamangalam,Maraimalainagar Post, Chengalpattu Taluk, Kanchipuram Dist-603209.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Adhi College of Engineering and Technology, No. 6, Munu  Adhi Nagar, Sankarapuram, Puliambakkam Post, Near Wallajabad Kancheepuram-631605.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Jei Mathaajee College of Engineering, No.124, Vishakandikuppam Village, Siruvakkam Post, Kanchipuram-631552.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Velammal Institute of Technology, Chennai - Kolkatta Highway, Pancheeti Village, Ponneri Taluk, Thiruvallur District-601204.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "GRT Institute of Engineering and Technology, GRT Mahalakshmi Nagar, Chennai-Tirupathi Highway, Tiruttani, Thiruvallur-631209.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "T.J.S. Engineering College, Peruvoyal, Near Kavaraipettai,Gummidipoondi Taluk,Thiruvallur District-601206.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Madha Institute of Engineering and Technology, Irandaam Kattalai, Sadhananthapuram, Thandalam post, Chennai-600122.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Mohamed Sathak A J College of Engineering (Autonomous), #34, Rajiv Gandhi Road(OMR), IT Highway, Siruseri, Egattur, Chennai-603103.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "Anand Institute of Higher Technology, Kalasalingam Nagar, Old Mahabalipuram Road, Kazhipattur Village, Chengalpattu Taluk, Kancheepuram District-603103.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "\tEaswari Engineering College (Autonomous), Bharathi Salai, Ramapuram, Chennai-600089.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "\tJeppiaar Engineering College, Jeppiaar Nagar, Old Mammallapuram Road, Kanchipuram, Chennai-600119.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "\tJerusalem College of Engineering (Autonomous), Velachery-Tambaram Main Road,Narayanapuram, Pallikkaranai,Chennai-600100.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "\tMeenakshi Sundararajan Engineering College (Autonomous), C/O I.I.E.T Society No.363, Arcot Road, Kodambakkam, Chennai-600024.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "\tMisrimal Navajee Munoth Jain Engineering College, Guru Marudhar Kesari Building, Jyothi Nagar, Thorapakkam, Chennai-600097.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "KCG college of Technology (Autonomous), Rajiv Gandhi Salai, Karapakkam, Chennai-600097.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "Sri Sivasubramaniya Nadar College of Engineering (Autonomous), Rajiv Gandhi Salai (OMR), Kalavakkam,Kanchipuram District-603110.",
    "ranking": 28,
    "cutoffDetails": []
  },
  {
    "college": "Agni College of Technology (Autonomous), Thalambur Off.Rajiv Gandhi Salai, Chengalpattu Taluk, Kancheepuram District-603103.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "St. Joseph's College of Engineering (Autonomous), Jeppiaar Nagar, Old Mamallapuram Road, Kanchipuram, Chennai-600119.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "T.J. Institute of Technology, Rajiv Gandhi Salai, Karapakkam, Chennai-600097.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Thangavelu Engineering College, Rajiv Gandhi Salai, Karapakkam, Chennai-600097.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Central Institute of Petrochemicals Engineering and Technology (Formerly Central Institute of Plastics Engineering and Technology) (CIPET)  Guindy  Chennai 600032",
    "ranking": "101-150",
    "cutoffDetails": []
  },
  {
    "college": "Dhanalakshmi Srinivasan College of Engineering and Technology, ECR, Poonjeri, Mamallapuram, Kanchipuram-603104.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Sri Sai Ram Institute of Technology (Autonomous), Sai Leo Nagar, Dharkast Road, West Tambaram, Kanchipuram, Chennai-600044.",
    "ranking": "101-150",
    "cutoffDetails": []
  },
  {
    "college": "St. Joseph College of Engineering, Trinity Campus, Nemili B Beemanthangal Village, Sriperumbudur, Kancheepuram District, Chennai-602105.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Shikshaa Institute of Advanced Technologies (formerly Vi Institute of Technology), No. 96 Sirunkundram Post,Chengalpattu Taluk,Kancheepuram District-603108.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Sri Krishna Institute of Technology, Navaneedam Nagar, Panapakkam, Near Padappai, Kanchipuram-601301.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Mahalakshmi Tech Campus (formerly Mahalakshmi Engineering College), No.1 Bharathiyar Street, Prashanthi Nagar, Chromepet,Chennai-600044.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Chennai Institute of Technology (Autonomous) Puduper Village  Nandambakkam Post  Kundrathur  Chennai 600069",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "Mohamed Sathak A.J. Academy of Architecture, IT Highway, 34, Old Mahabalipuram Road, Egattur, Chenglepet Taluk, Kancheepuram District-603103.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "\tAdhiparasakthi Engineering College, Melmaruvathur, Cheyyur Taluk, Kancheepuram District-603319.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "\tAnnai Teresa College of Engineering, Thirunavalur, Ulundurpet Taluk, Villupuram District-607204.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "\tDhanalakshmi College of Engineering, Manimangalam Puducheri Road, Manimangalam, Manimangalam Post, Sriperumbudur Taluk, Kancheepuram District, Chennai-601301.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "\tG K M College of Engineering and Technology, G K M Nagar, Alappakkam-Mappedu Road, New Perugalathur, Chennai-600063.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "\tIFET College of Engineering (Autonomous), IFET Nagar, Gangarampalayam, Valavanur Post, Villupuram District-605108.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "Karpaga Vinayaga College of Engineering and Technology, G.S.T. Road, Chinna Kolambakkam, Palayanoor Post, Madurantagam Taluk, Kancheepuram Dist-603308.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Madha Engineering College, Madha Nagar,Somangalam Road, Kundrathur, Kanchipuram, Chennai-600069.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Mailam Engineering College, Mailam, Tindivanam Taluk, Villupuram District-604304.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Sri Venkateswaraa College of Technology, Sirukulathur, Vadakal Village, Mathur Post, Sriperumbhudur, Kanchipuram-602105.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Government College of Technology (Autonomous)  Thadagam Road  Coimbatore District 641013",
    "ranking": 56,
    "cutoffDetails": []
  },
  {
    "college": "PSG College of Technology (Autonomous)  Peelamedu  Coimbatore District 641004",
    "ranking": 34,
    "cutoffDetails": []
  },
  {
    "college": "Coimbatore Institute of Technology (Autonomous)  Civil Aerodrome Post  Coimbatore District 641014",
    "ranking": 47,
    "cutoffDetails": []
  },
  {
    "college": "REGIONAL CAMPUS - COIMBATORE",
    "ranking": "151-200"
  },
  {
    "college": "Sri Shanmugha College of Engineering and Technology (REGIONAL CAMPUS - COIMBATORE)",
    "ranking": "101-150"
  },
  {
    "college": "\tN.S.N. College of Engineering and Technology, N.S.N, Kalvi Nagar, Karur - Madurai NH-7, Manalmedu, Karur-639003.",
    "ranking": "201-300"
  },
  {
    "college": "Rathinam Technical Campus (Autonomous), Rathinam Techzone Campus, Pollachi Road, Eachanari, Coimbatore-641021.",
    "ranking": "151-200"
  },
  {
    "college": "Aishwarya College of Engineering and Technology, Errattaikarad, Paruvachi (Post), Anthiyur, Bhavani (Taluk), Erode District-638312.",
    "ranking": "201-300"
  },
  {
    "college": "Asian College of Engineering and Technology, 294/2,Asian College Road, Kondayampalayam, Near Saravanampatti, Coimbatore-641110.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Ganesh College of Engineering, Attur Main Road, Mettupatti, Salem-636111.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Sri Ranganathar Institute of Engineering and Technology, S.F No:162, Athipalayam village, Thudiyalur-kovilpalayam Road, Coimbatore-641110.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Indian Institute of Handloom Technology  Foulke's Compound  Thillai Nagar  Salem District 636001",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Dhirajlal Gandhi College of Technology, Sikkanampatty, Opposite to Airport,Omalur Taluk, Salem District-636309.",
    "ranking": "201-300"
  },
  {
    "college": "\tShree Sathyam College of Engineering and Technology, Manjakkal Patti, Kuppanur Post, Sankari Taluk, Salem District-637301.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "A V S College of Technology, Attur Main Road, Near AVS College of Arts & Science, Chinnagoundapuram, Salem-636106.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Dhaanish Ahmed Institute of Technology, Pitchanur Village, Coimbatore-641018.",
    "ranking": "201-300"
  },
  {
    "college": "Jairupaa College of Engineering, Thottiapalayam, Kathankanni-Po, Kangayam-Tk, Tiruppur-641604.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "\tV.S.B. College of Engineering Technical Campus (Autonomous), S.F. No.91/2A,91/2B,252, 253/1, Solavampalayam Village, Kinathukadavu, Pollachi Taluk, Coimbatore District-642109.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "\tSuguna College of Engineering, Nehru Nagar (West), Kalapatti Road, Civil Aerodrome (Post), Coimbatore-641014.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "\tArjun College of Technology, 310/1B, Chettiyakkapalayam, Kinathukadavu, Coimbatore-642120.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Vishnu Lakshmi College of Engineering and Technology, 10/1,Kambar Street, Kanjikonampalayam, Vellalore(PO), Coimbatore-641111.",
    "cutoffDetails": [],
    "ranking": "201-300"
  },
  {
    "college": "Government College of Engineering  Chettikkarai Post  Dharmapuri District 635704",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "PSG Institute of Technology and Applied Research, Avinashi Road,Neelambur, Sulur,Coimbatore -641062.",
    "ranking": "101-150",
    "cutoffDetails": []
  },
  {
    "college": "\tCheran College of Technology, Cheran Nagar, Thittuparai, Kangeyam, Tiruppur-638701.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Adhiyamaan College of Engineering (Autonomous), Aeri Campus, Dr.M.G.R.Nagar, Hosur, Krishnagiri District-635109.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "\tAnnai Mathammal Sheela Engineering College, Erumapatty Post, Namakkal-637013.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Government College of Engineering (Autonomous)  Bargur  Krishnagiri District 635104",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "K S Rangasamy College of Technology (Autonomous), K.S.R Kalvi Nagar, Thokkavadi, Tiruchengode Tk, Namakkal-637215.",
    "ranking": "101-150"
  },
  {
    "college": "M.Kumarasamy College of Engineering (Autonomous), Thalavapalayam Post,Punjai Thottakkurichi Village, Karur Tk, Karur-639113.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "Mahendra Engineering College (Autonomous), Mahendhirapuri, Mallasamudram West, Vadugapalayam Post,Tiruchengodu Taluk, Namakkal District-637503.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Muthayammal Engineering College (Autonomous), Kakkaveri, Rasipuram (Tk), Namakkal District-637408.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Paavai Engineering College (Autonomous), NH-7, Paavai Nagar, Pachal, Namakkal-637018.",
    "ranking": "101-150",
    "cutoffDetails": []
  },
  {
    "college": "PGP College of Engineering and Technology, Namakkal-Paramathi NH 7 Road, Namakkal-637207.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "K S R College of Engineering (Autonomous), K S R Kalvi Nagar, Thokkavadi, Tiruchengode, Namakkal Dist-637215.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "SSM College of Engineering, NH-47 Salem Main Road, Komarapalayam, Namakkal District-638183.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Government College of Engineering (Autonomous)  Karuppur  Salem District 636011",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "\tSapthagiri College of Engineering, NH-7, Krishnagiri Main Road,Palacode Taluk Periyanahalli Village & Post Dharmapuri District-635205.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Sengunthar Engineering College (Autonomous), Kosavampalayam, Kumaramangalam (Post),Tiruchengode (Taluk),Namakkal District-637205.",
    "ranking": "201-300",
    "cutoffDetails": []
  },
  {
    "college": "Sona College of Technology (Autonomous), Sona Nagar, Thiagarajar Polytechnic College Road, Suramangalam (P.O),Salem District-636005.",
    "ranking": "151-200",
    "cutoffDetails": []
  },
  {
    "college": "Vivekanandha College of Engineering for Women (Autonomous), Sathiyanaickenpalayam Village, Elay\n"
  }
]